# Ejercicios

In [14]:
import pandas as pd

url = "https://gist.githubusercontent.com/ahcamachod/807a2c1cf6c19108b2b701ea1791ab45/raw/fb84f8b2d8917a89de26679eccdbc8f9c1d2e933/alumnos.csv"
datos = pd.read_csv(url, sep = ",")

## Ejercicio 1
Verifica si la base de datos contiene datos nulos y, en caso de tenerlos, realiza el tratamiento de estos datos nulos de la manera que consideres más coherente con la situación.

In [15]:
datos.head()

    Nombre  Edad  Nota Aprobado
0  Alberto    20   7.5     True
1      Ana    18   NaN    False
2   Camila    27   2.5    False
3    David    18   5.0    False
4    Brian    21  10.0     True

In [16]:
datos.isnull().sum()

Nombre      0
Edad        0
Nota        6
Aprobado    0
dtype: int64

In [17]:
datos = datos.fillna(6.0)
datos

      Nombre  Edad  Nota   Aprobado
0    Alberto    20   7.5       True
1        Ana    18   6.0      False
2     Camila    27   2.5      False
3      David    18   5.0      False
4      Brian    21  10.0       True
5      Bruna    23   6.0      False
6    Daniela    21   7.0       True
7     Carlos    19   6.0      False
8     Alicia    35   5.6      False
9     Victor    28   6.0      False
10    Danilo    21   6.0      False
11   Ignacio    24   4.5      False
12  Stephany    26  10.0       True
13    Miriam    25   9.0       True
14     Pablo    37   6.0      False
15    Milena    29   7.0       True
16     Lucas    33   6.0      False
17     Nadia    34   8.0  Verdadero

Los estudiantes "Alicia" y "Carlos" ya no forman parte del grupo. Por lo tanto, elimínalos de la base de datos.

In [19]:
datos_remover = datos.query("Nombre == 'Alicia' | Nombre == 'Carlos'").index
datos.drop(datos_remover, axis = 0, inplace = True)
datos

      Nombre  Edad  Nota   Aprobado
0    Alberto    20   7.5       True
1        Ana    18   6.0      False
2     Camila    27   2.5      False
3      David    18   5.0      False
4      Brian    21  10.0       True
5      Bruna    23   6.0      False
6    Daniela    21   7.0       True
9     Victor    28   6.0      False
10    Danilo    21   6.0      False
11   Ignacio    24   4.5      False
12  Stephany    26  10.0       True
13    Miriam    25   9.0       True
14     Pablo    37   6.0      False
15    Milena    29   7.0       True
16     Lucas    33   6.0      False
17     Nadia    34   8.0  Verdadero

Aplica un filtro que seleccione solo a los estudiantes que fueron aprobados.

In [21]:
filtro = (datos['Nota'] > 6)
aprobados = datos[filtro]
aprobados

      Nombre  Edad  Nota   Aprobado
0    Alberto    20   7.5       True
4      Brian    21  10.0       True
6    Daniela    21   7.0       True
12  Stephany    26  10.0       True
13    Miriam    25   9.0       True
15    Milena    29   7.0       True
17     Nadia    34   8.0  Verdadero

Guarda el DataFrame que contiene solo a los estudiantes aprobados en un archivo CSV llamado "alumnos_aprobados.csv".

In [22]:
aprobados.to_csv("alumnos_aprobados.csv", index=False, sep = ',')